{"inkVersion":21,"root":[[{"->":"Start"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"Start":["^Legend has it that in the Western Regions, there was a true master of culinary arts. No one knew where he came from. He came to this town, stirred life's myriad flavors into his pot, and was revered by all. The inn he opened flourished, with guests coming and going continuously. ","#","^character:Narration ","/#","#","^style:Narration ","/#","#","^place:5","/#","\n","^I was inspired by his deeds, diligently practiced my cooking skills, and dreamed of becoming a master like him. At the age of nineteen, I finally made a name for myself in the capital city. However, I felt my culinary skills were still far from sufficient, so I traveled thousands of miles to the Western Regions to meet this master.","\n","^However, time is merciless. By the time I arrived at the inn, the master had already passed away, and the inn had fallen into disrepair. ","#","^character:Narration","/#","\n","^I spent several days revitalizing the inn, trying to restore some of its functions. I believe that even though the master is no longer in this world, if I feel with my heart, I can definitely learn the essence of the master's culinary arts. ","#","^character:Narration","/#","\n",{"->":"ScenceOne"},{"#f":1}],"ScenceOne":["#","^background:Lobby","/#","^Phew... It's been tough, but we can barely open for business tomorrow. ","#","^character:protagonist ","/#","#","^place:4 ","/#","#","^sound:BGM2 ","/#","#","^track:2","/#","\n","^At this moment, a rapid knocking sound came from the door, and I hurriedly went to the lobby. ","#","^character:Narration ","/#","#","^style:Default ","/#","#","^sound:KnockingDoor ","/#","#","^track:1","/#","\n","^Upon arriving in the lobby, the protagonist sees a middle-aged man standing at the door. His face looks weathered, and his lively eyes are darting around, sizing up the protagonist. Seeing the protagonist walk in, he takes off his worn felt hat and bows. ","#","^character:Laofu ","/#","#","^place:2 ","/#","#","^sound:none ","/#","#","^track:1","/#","\n","^Let me introduce myself. My name is Laofu, honest Laofu, a merchant from this town. I heard you're opening a shop here, so you'll definitely need a reliable supplier. ","#","^character:Laofu","/#","\n","^Since you're a local, could you tell me a bit about the town? ","#","^character:protagonist","/#","\n","^Of course, I can. ","#","^character:Laofu","/#","\n","^What would you like to know? ","#","^character:Laofu","/#","\n",{"->":".^.Town"},{"Town":[["ev","str","^Can you tell me about the origin of this town?","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^How much do you know about the people here?","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^About doing business here, to which king do we have to pay taxes?","/str","/ev",{"*":".^.c-2","flg":4},["ev",{"^->":"ScenceOne.Town.0.18.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str",{"^->":"ScenceOne.Town"},"turns",0,"!=","/ev",{"*":".^.^.c-3","flg":19},{"s":["^So it turns out, this little town has quite a story. ","#","^character:protagonist","/#",{"->":"$r","var":true},null]}],{"c-0":["\n","^This city was built around an oasis, hence it was named \"White Jade Town.\" It started as a rest stop for traveling caravans, but gradually various shops opened up, and the town began to take its initial shape. ","#","^character:Laofu","/#","\n",{"->":".^.^.^"},{"#f":5}],"c-1":["\n","^Since it's a commercial city, you'll find all sorts of people here: people from the Western Regions, the Central Plains, Persians, Turks, and there's no fixed religion. There's a temple to the god of the Western Regions in town, and on the last night of winter, everyone gathers there for a grand banquet to celebrate the start of the new year. It's quite lively! ","#","^character:Laofu","/#","\n",{"->":".^.^.^"},{"#f":5}],"c-2":["\n","^Territorially, this place belongs to the Hami tribe's domain. Initially, it was managed by the tax officer of the Hami chieftain. About a decade ago, the Hami chieftain granted this place as a fief to a noble, and now the land has passed to the second generation of female nobles. ","#","^character:Laofu","/#","\n","^Although the nobility has a lot of say here, they rarely show up, and it's generally up to the tax officer to handle various affairs. Oh, and there's also a constable responsible for maintaining public order. Although he's a local, he wears the official uniform of the Tang Dynasty, so you shouldn't neglect her. ","#","^character:Laofu","/#","\n",{"->":".^.^.^"},{"#f":5}],"c-3":["ev",{"^->":"ScenceOne.Town.0.c-3.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.18.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.^.^.otherQuestion"},{"#f":5}]}],{"#f":3}],"otherQuestion":[[["ev",{"^->":"ScenceOne.otherQuestion.0.0.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^Has anything unusual happened in town recently? ","#","^character:protagonist","/#",{"->":"$r","var":true},null]}],"ev","str","^About your face...","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^Let's talk about the goods!","/str","/ev",{"*":".^.c-2","flg":4},{"c-0":["ev",{"^->":"ScenceOne.otherQuestion.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.0.s"},[{"#n":"$r2"}],"\n","^Unusual things happen every day. For example, the shopkeeper's wife who sells vinegar gave birth to a child who doesn't look like her husband at all. ","#","^character:Laofu","/#","\n","^Uh... Anything else besides that? ","#","^character:protagonist","/#","\n","^Lately, the weather has been getting hotter, and everyone wants to drink something refreshing, so the prices of alcoholic beverages are about to go up. ","#","^character:Laofu","/#","\n","^(Muttering) Maybe I can add some more drinks to the menu. ","#","^character:protagonist","/#","\n",{"->":".^.^.^"},{"#f":5}],"c-1":["\n","^You seem to be wearing a very intricate... mask? ","#","^character:protagonist","/#","\n","^Laofu's eyes unashamedly flash with cunning, and he slightly opens his mouth, as if to intentionally reveal his sharp little fangs and stir his crimson tongue. ","#","^character:Narration","/#","\n","^I didn't expect you to see through my illusion. Of course, you needn't worry. This world is not only inhabited by humans wandering these sacred desert trade routes. If you pay attention, you can find many of my kin hidden among humans. Please keep this a secret. ","#","^character:Laofu","/#","\n",{"->":".^.^.^"},{"#f":5}],"c-2":["\n","^I'm new here and not familiar with everything, so I do need a reliable supplier. What's your price? ","#","^character:protagonist","/#","\n","^I take a twenty percent commission. ","#","^character:Laofu","/#","\n","^That's a bit too much, no more than fifteen percent. ","#","^character:protagonist","/#","\n","^Plus two meals a day. ","#","^character:Laofu","/#","\n","^Then I decide what the meals are. ","#","^character:protagonist","/#","\n",{"->":".^.^.^.^.aboutGoods"},{"#f":5}]}],{"#f":1}],"aboutGoods":[["^Deal  ","#","^character:Laofu","/#","\n",["ev",{"^->":"ScenceOne.aboutGoods.0.5.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":18},{"s":["^I want to take a look at the goods. ","#","^character:protagonist","/#",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"ScenceOne.aboutGoods.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.5.s"},[{"#n":"$r2"}],"\n","^No problem at all. ","#","^character:Laofu","/#","\n",["ev","visit",1,"MIN","/ev","ev","du",0,"==","/ev",{"->":".^.s0","c":true},"ev","du",1,"==","/ev",{"->":".^.s1","c":true},"nop",{"s0":["pop",{"->":".^.^.17"},null],"s1":["pop",{"->":".^.^.17"},null],"#f":5}],"^ ","#","^event:LoadFood","/#","\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^Any other questions? ","#","^character:Laofu","/#","\n","ev","str","^Agree to the supply partnership","/str","/ev",{"*":".^.c-1","flg":20},{"c-1":["\n","^Alright, I have no more questions. ","#","^character:protagonist","/#","\n","^I'll bring the goods over tomorrow morning. ","#","^character:Laofu","/#","\n","^After saying this, Laofu drags a wooden box from under the table to you. ","#","^character:Narration","/#","\n","^The box neatly contains some very high-quality liquor and wild fruits. ","#","^character:Narration","/#","\n","^This is my greeting gift. I hope our cooperation will be pleasant. ","#","^character:Laofu","/#","\n","^Alright, I'll go prepare your dinner. ","#","^character:protagonist","/#","\n","^Oh, boss, you're really too kind. ","#","^character:Laofu","/#","\n",["ev","visit",1,"MIN","/ev","ev","du",0,"==","/ev",{"->":".^.s0","c":true},"ev","du",1,"==","/ev",{"->":".^.s1","c":true},"nop",{"s0":["pop",{"->":".^.^.17"},null],"s1":["pop",{"->":".^.^.17"},null],"#f":5}],"^ ","#","^event:LoadBBQ","/#","\n","^You serve the grilled skewers to Laofu, and the aroma of the grilled meat firmly captures his soul. He excitedly takes the grilled meat, and during the eating process, you see a hint of his true form. ","#","^character:protagonist","/#","\n","^This is what humans should eat. The original chefs in town cooked terribly, even worse than Laofu's mother's cooking. ","#","^character:Laofu","/#","\n","^Laofu looked at you, then said. ","#","^character:Narration","/#","\n","^Because Laofu's mother is an ordinary fox, so she can't cook at all. ","#","^character:Laofu","/#","\n","^Laofu only ate one skewer of grilled meat. He carefully wrapped the rest of the grilled meat in paper, wiping the drool from the corner of his mouth, you guessed he probably wants to sell it at a good price. ","#","^character:Laofu","/#","\n","^You accept Laofu's greeting gift, and indeed, they are all very high-quality ingredients. ","#","^character:protagonist","/#","\n","^The fruits can be used for desserts or eaten cold, and the liquor was immediately useful. You place a few bottles on the counter for preparation, and the rest are stored in the cellar. ","#","^character:protagonist","/#","\n",["ev","visit",1,"MIN","/ev","ev","du",0,"==","/ev",{"->":".^.s0","c":true},"ev","du",1,"==","/ev",{"->":".^.s1","c":true},"nop",{"s0":["pop",{"->":".^.^.17"},null],"s1":["pop",{"->":".^.^.17"},null],"#f":5}],"^ ","#","^event:LoadDay1","/#","\n","end",{"#f":5}],"#f":5}]}],{"#f":1}],"#f":1}],"#f":1}],"listDefs":{}}